package Lesson3_Homework;
//Задача 2.
//Создайте программу, выводящую на экран
//все неотрицательные элементы последовательности
//10, 6, 2,-2,-6,-10

public class Task_2 {
    public static void main(String[] args) {
        for (int i =10; i>=-10; i -=4){
            if (i>=0){
          System.out.println(i);
            }
        }

    }

}
