package Lesson2_Homework;

//Задача 2.
// Подрабатывая в течение года, Вася собрал себе определенную сумму на поездку за границу,
//а родители добавили ему от себя еще некоторую сумму.
// Выведите в консоль сколько денег есть у Васи на отпуск (в евро) если:
//Вася заработал 5000 грн,Родители добавили+5000,
//курс евро 1 евро = 28 грн

public class Task2 {


    public static void main(String[] args) {
int summaVasy =5000;
int summaRoditeley =5000;
System.out.println((summaVasy+summaRoditeley)*28);
    }
}